Revit 2027 API
MEPSupportFailures Properties
The BuiltInFailures.MEPSupportFailures type exposes the following members.
Properties
Name | Description
CannotMatchInstanceSizeToHostError |  The instance of [Symbol] cannot be re-sized to match the host.
InstanceOutOfHostError |  The instance of [Symbol] lost its host and will be deleted.
InstanceProfileNotMatchWithHostError |  The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.
TypeSizeNotMatchWithHostError |  The [Symbol] does not match the size of the host.
Top
See Also
Reference
BuiltInFailures.MEPSupportFailures Class
Autodesk.Revit.DB Namespace